app/models/user.rb

   def cart_create
     Cart.create(id: self.id, user_id: self.id)
---
INSERT INTO "carts" ("id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 1], ["created_at", "2019-11-26 17:30:50.993332"], ["updated_at", "2019-11-26 17:30:50.993332"], ["user_id", 1]]